app/controllers/books_controller.rb

  def borrow
    @book.borrowed = true
    @book.user_id = current_user.id

    if @book.save
---
UPDATE "books" SET "borrowed" = ?, "user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["borrowed", 1], ["user_id", 2], ["updated_at", "2018-06-26 10:31:31.937860"], ["id", 3]]

  def return
    @book.borrowed = false
    @book.user_id = nil

    if @book.save
---
INSERT INTO "books" ("book_name", "author", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["book_name", "sky11"], ["author", "diksha"], ["price", 40.0], ["created_at", "2018-06-21 06:04:13.205657"], ["updated_at", "2018-06-21 06:04:13.205657"], ["user_id", 1]]
UPDATE "books" SET "borrowed" = ?, "user_id" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["borrowed", 0], ["user_id", nil], ["updated_at", "2018-06-27 12:53:11.799830"], ["id", 2]]

  def create
    @book = Book.new(book_params)
    @book.borrowed = false

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("book_name", "author", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_name", "Jungle Book"], ["author", "Ayush"], ["price", 200.0], ["created_at", "2018-06-26 10:16:27.771168"], ["updated_at", "2018-06-26 10:16:27.771168"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "price" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["price", 600.0], ["updated_at", "2018-06-26 10:16:59.264713"], ["id", 4]]

  def destroy
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]

    def set_book
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]