app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

    if @user.destroy